[
    {
      "id": "css-flexbox-guide",
      "title": "راهنمای جامع Flexbox در CSS: از مبتدی تا پیشرفته",
      "author": "گیمنی",
      "date": "۲۰ مرداد ۱۴۰۴",
      "image": "https://images.unsplash.com/photo-1528645602411-bbeb1d5620de?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwzNTc5fDB8MXxzZWFyY2h8N3x8Y29kaW5nJTIwYmFja2dyb3VuZHxlbnwwfHx8fDE2NTk0NzU5ODI&ixlib=rb-1.2.1&q=80&w=1080",
      "category": "برنامه نویسی",
      "summary": "Flexbox یکی از قدرتمندترین ابزارهای CSS برای ساخت লে‌آوت‌های واکنش‌گرا است. در این راهنما، تمام مفاهیم آن را با مثال‌های عملی یاد خواهید گرفت.",
      "content": "<h2>Flexbox چیست؟</h2><p>Flexbox یک ماژول چیدمان در CSS است که برای طراحی مدل‌های چیدمان یک بعدی (در یک خط) طراحی شده است. با استفاده از آن می‌توانید آیتم‌ها را در یک کانتینر به راحتی تراز کرده و فضای بین آن‌ها را مدیریت کنید.</p><h3>مثال کاربردی: ساخت یک نوبار (Navbar)</h3><p>یکی از بهترین مثال‌ها برای درک قدرت Flexbox، ساخت یک نوبار ساده است. کد HTML ما به این شکل است:</p><pre><code class=\"language-html\"><nav class=\"navbar\">\n  <a href=\"#\" class=\"logo\">MyLogo</a>\n  <ul class=\"nav-links\">\n    <li><a href=\"#\">Home</a></li>\n    <li><a href=\"#\">About</a></li>\n    <li><a href=\"#\">Contact</a></li>\n  </ul>\n</nav></code></pre><p>و حالا با چند خط کد Flexbox، آن را استایل می‌دهیم:</p><pre><code class=\"language-css\">.navbar {\n  display: flex;\n  justify-content: space-between; /* آیتم‌ها را در دو سر نوبار قرار می‌دهد */\n  align-items: center; /* آیتم‌ها را به صورت عمودی در مرکز تراز می‌کند */\n  background-color: #333;\n  padding: 1rem;\n}\n\n.nav-links {\n  display: flex;\n  list-style: none;\n  gap: 20px; /* فاصله بین آیتم‌های منو */\n}</code></pre><h2>نتیجه‌گیری</h2><p>همانطور که مشاهده کردید، Flexbox به ما اجازه می‌دهد تا چیدمان‌های پیچیده را با کدی بسیار خوانا و کوتاه پیاده‌سازی کنیم. این ابزار برای هر توسعه‌دهنده فرانت‌اند ضروری است.</p>",
      "tags": ["CSS", "Flexbox", "فرانت‌اند", "آموزش"]
    },
    {
      "id": "jujutsu-kaisen-s2-analysis",
      "title": "تحلیل فصل دوم انیمه جوجوتسو کایسن: اوج اقتباس",
      "author": "گیمنی",
      "date": "۱۴ مرداد ۱۴۰۴",
      "image": "images/jjk-cover.jpg",
      "category": "انیمه",
      "summary": "فصل دوم جوجوتسو کایسن با پوشش آرک‌های گذشته گوجو و حادثه شیبویا، یکی از بهترین اقتباس‌های تاریخ انیمه را رقم زد. در این مطلب به بررسی دلایل موفقیت آن می‌پردازیم.",
      "content": "<h2>مقدمه: بازگشت یک غول</h2><p>فصل دوم انیمه جوجوتسو کایسن، ساخته استودیو MAPPA، نه تنها انتظارات را برآورده کرد، بلکه استانداردهای جدیدی برای اقتباس از مانگا تعیین نمود. این فصل با تقسیم شدن به دو بخش اصلی، یعنی آرک گذشته ساتورو گوجو و آرک حادثه شیبویا، توانست هم به توسعه شخصیت‌ها بپردازد و هم اکشنی بی‌نظیر را به نمایش بگذارد.</p><h3>کیفیت انیمیشن و کارگردانی</h3><p>یکی از برجسته‌ترین نقاط قوت این فصل، کیفیت بصری آن است. کارگردانی شگفت‌انگیز در سکانس‌های مبارزه، به خصوص نبرد سوکونا و ماهاراگا، تجربه‌ای نفس‌گیر را برای بیننده فراهم می‌کند. استفاده هوشمندانه از رنگ، نور و زوایای دوربین، هر فریم را به یک اثر هنری تبدیل کرده است.</p><h3>وفاداری به مانگا و توسعه شخصیت</h3><p>آرک گذشته گوجو به زیبایی رابطه او با گتو سوگورو را به تصویر کشید و زمینه‌ساز تراژدی‌های آینده شد. آرک شیبویا نیز با ریتم سریع و حوادث تکان‌دهنده، وفاداری بی‌نظیری به منبع اصلی داشت و توانست فشار و استیصال شخصیت‌ها را به خوبی منتقل کند.</p><h2>نتیجه‌گیری</h2><p>فصل دوم جوجوتسو کایسن یک شاهکار به تمام معناست که هر طرفدار انیمه‌ای باید آن را تماشا کند. این فصل نمونه‌ای عالی از چگونگی یک اقتباس موفق است.</p>",
      "tags": ["جوجوتسو کایسن", "تحلیل", "اکشن", "ماپا"]
    },
    {
      "id": "attack-on-titan-ending-explained",
      "title": "پایان حمله به تایتان: شرح کامل و مفاهیم پنهان",
      "author": "گیمنی",
      "date": "۱۰ مرداد ۱۴۰۴",
      "image": "images/aot-cover.jpg",
      "category": "انیمه",
      "summary": "پایان حماسی حمله به تایتان بسیاری را با سوالات بی‌پاسخ رها کرد. در این تحلیل عمیق، به بررسی معنای واقعی پایان داستان ارن یگر و چرخه نفرت می‌پردازیم.",
      "content": "<h2>پایان یک حماسه</h2><p>پایان مانگا و انیمه Attack on Titan یکی از بحث‌برانگیزترین پایان‌ها در تاریخ مدیوم بود. آیا ارن یک قهرمان بود یا یک هیولا؟ آیا صلح واقعی به دست آمد؟</p><h3>چرخه بی‌پایان نفرت</h3><p>مهم‌ترین پیامی که هاجیمه ایسایاما قصد انتقال آن را داشت، ماهیت تکرارشونده نفرت و جنگ است. ارن با اجرای \"Rumbling\" تلاش کرد تا این چرخه را با نابود کردن دنیای خارج از پارادایس بشکند، اما در نهایت، حتی عمل افراطی او نیز نتوانست ریشه‌های درگیری را به طور کامل از بین ببرد. سکانس پایانی که نشان می‌دهد جزیره پارادایس در آینده دوباره مورد تهاجم قرار می‌گیرد، گواهی بر این حقیقت تلخ است.</p><h3>آزادی چیست؟</h3><p>مفهوم آزادی برای ارن، رهایی از دیوارها و سرکوب بود. اما او در مسیر رسیدن به این آزادی، خود به یک سرکوبگر تبدیل شد. داستان این سوال را مطرح می‌کند که آیا آزادی مطلق بدون قربانی کردن آزادی دیگران ممکن است؟ پایان داستان نشان می‌دهد که آزادی مفهومی پیچیده و چندوجهی است.</p><h2>نتیجه‌گیری</h2><p>پایان حمله به تایتان شاید برای همه راضی‌کننده نباشد، اما یک پایان قدرتمند و فکر شده است که مخاطب را تا مدت‌ها به فکر فرو می‌برد. این یک پایان تلخ اما واقع‌گرایانه برای داستانی بود که هرگز از نمایش سیاهی‌های طبیعت انسان ابایی نداشت.</p>",
      "tags": ["حمله به تایتان", "نقد", "پایان", "ایسایاما"]
    }
  ]